Revit 2027 API
Document.GetSubelement(String) Method
 Gets the subelement referenced by a unique id string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Subelement GetSubelement(
	string uniqueId
)
Public Function GetSubelement (
	uniqueId As String
) As Subelement
public:
Subelement^ GetSubelement(
	String^ uniqueId
)
member GetSubelement :
        uniqueId : string -> Subelement
Parameters
uniqueId String
 The unique id that identifies element or subelement.
UniqueId
Return Value
Subelement
 The subelement referenced by the input argument.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
null will be returned if the input id string doesn't reference to a valid element or subelement.
See Also
Reference
Document Class
GetSubelement Overload
Autodesk.Revit.DB Namespace